[{"text":"Here is my original article explaining why Gilley work is historically illiterate racist garbage","category":"social issue"},{"text":"2 years ago, when Bruce Gilley published an article on why \"colonialism was good,\" I said he would relish the backlash, and claim he was being persecuted by leftists for independent thought even though his article was an obviously fraudulent and racist piece of pseudoscholarship.","category":"social issue"},{"text":"Football is the most popular sport by far","category":"sport"},{"text":"The hurricane center advised that heavy rains from the storm were expected to occur","category":"disaster and accident"},{"text":"That was a great tennis match","category":"sport"},{"text":"Excited to announce that my new book, \"Trump: Anatomy of a Monstrosity,\" is now available for purchase! https://www.amazon.com/Trump-Anatomy-Monstrosity-Nathan-Robinson/dp/0997844779/ref=sr_1_1?s=books&ie=UTF8&qid=1485708962&sr=1-1&keywords=trump+anatomy+of+a+monstrosity …","category":"politics"},{"text":"Good lord, we've raised $30,000 in 48 hours. @curaffairs has such incredibly supportive readers. Bless you all. We won't let you down.","category":"arts, culture and entertainment"},{"text":"To raise money for @curaffairs, our podcast is releasing 7 extraordinary podcast interviews in 7 days. DAY 3: I talk to @johannhari101 about the social causes of addiction and depression!","category":"social issue"},{"text":"Both @PplPolicyProj and @jacobinmag are of immeasurable value in pushing public conversation left and making it clear that left ideas are rational and viable. Amazing what @MattBruenig has managed to pull off with PPP, a viable crowdfunded socialist alternative to Brookings et al","category":"politics"},{"text":"the faster we meet our goal, the faster nathan can get a full night’s sleep again. PLEASE HELP US","category":"human interest"},{"text":"If it’s the official company car that you use to travel to all important meetings, I fail to see how anyone could reasonably object.","category":"economy, business and finance"},{"text":"https://www.currentaffairs.org/2017/05/the-real-obama …","category":"politics"},{"text":"i am genuinely not above doing this. i can also write takedowns of children for birthday parties.","category":"lifestyle and leisure"},{"text":"This interview between @lyta_gold, @orennimni, and @onekade about the impact of surveillance tech on civil liberties, is fun and scary and informative. It's part of 7 interviews we're releasing in 7 days to raise money to expand our magazine!","category":"economy, business and finance"},{"text":"Our Current Affairs fundraiser is just shy of 200 backers! Will you donate and help us hit this arbitrary but extremely impressive number??","category":"economy, business and finance"},{"text":"My pals @curaffairs are blowing up a kickstarter to produce quality, fun leftist video, expand the mag and build the podcast.\nI’m about to evacuate a climate change-driven hurricane, so how about you throw your beer money at the best left media op running! \n#Bernie2020","category":"environmental issue"},{"text":"The more you donate, the more of them we can buy. Help the left build a fleet:","category":"economy, business and finance"},{"text":"Look, I know we promised to spend the money from the fundraiser on improving the magazine, but the campaign is going better than expected and I just saw this photo on twitter. Am sure donors will agree that buying one of these for CA is a prudent use of funds.","category":"politics"},{"text":"To kick off our magazine fundraising campaign, we're releasing seven straight days of incredible podcast interviews. Day 1: Barbara Ehrenreich!","category":"economy, business and finance"},{"text":"WOW! In the first 24 hours of our fundraiser, we made as much as we did in the entire 30 days of our start up campaign in 2015. THANK YOU SO MUCH everybody. We are going to do incredible things at @curaffairs. Check out our fundraising campaign here:","category":"politics"},{"text":"dogs can be vegan so maybe wolves just need an attitude adjustment","category":"human interest"},{"text":"\"we should make wolves eat broccoli\" vs. \"wolves need to eat human babies\" is for some reason how this debate is actually playing out.","category":"human interest"},{"text":"WOW thank you @curaffairs readers, in just the first hour we got $2k!! If we keep this up we will have 1.44 million dollars by the end of fundraiser. I believe that with that amount of money we can destroy @BreitbartNews, @realDailyWire, and probably @foxnews. Let's keep it up!","category":"economy, business and finance"},{"text":"Current Affairs has big news: we're raising money for a huge expansion of our operation in 2020, including more on-the-ground journalism, an overhaul of our website, new videos, and better podcasts. We need your help to take our magazine to the next level!","category":"economy, business and finance"},{"text":"At 2300 a month for 79 months I’ve paid over 150k on the balance of my 180k law school loan. But I still owe nearly 100k. \n\nPeople who argue “I’ve worked hard to pay my debts, so should they” are radically missing the point.","category":"economy, business and finance"},{"text":"reminder: in 1 hour, see tim faust and myself at the Garden District Bookshop in New Orleans!","category":"economy, business and finance"},{"text":"stop pretending that ⁦@JoeBiden⁩ is the responsible choice | new by ⁦@LukewSavage⁩ and ⁦@NathanJRobinson⁩","category":"politics"},{"text":"i insist they're just not trying hard enough","category":"arts, culture and entertainment"},{"text":"last week we published a parody NYT column by @JasonAdamK in which a conservative blowhard insists that being insulted by Twitter randos signifies the decline of American discourse. This week Bret Stephens is on TV complaining that someone called him a bedbug on Twitter.","category":"arts, culture and entertainment"},{"text":"our editors ⁦@orennimni⁩ and ⁦@NathanJRobinson⁩ reflect on malcolm x’s legacy.","category":"politics"},{"text":"\"companies like Spirit Airlines aren’t just abusing their customers. They abuse their employees, forcing them to be shouted at by people with perfectly legitimate complaints...  just there to absorb public outrage, which is a wearying and depressing job\"","category":"social issue"},{"text":"TONIGHT! come see @crulge and myself at the Garden District Bookshop. His new book \"Health Justice Now!\" is exceptionally good and I guarantee this will be the most lively conversation about healthcare financing you've seen all year.","category":"arts, culture and entertainment"},{"text":"Interview will be unlocked for the general public in 2 weeks. Support us on patreon to listen now!","category":"politics"},{"text":"The book is exceptional and everyone should pre-order it","category":"arts, culture and entertainment"},{"text":"Had the privilege of interviewing @KeeangaYamahtta about her upcoming book \"Race for Profit: How Banks and the Real Estate Industry Undermined Black Homeownership\" for the @curaffairs podcast!","category":"economy, business and finance"},{"text":".@NathanJRobinson: \"It’s hard to describe just what a negative force the #KochBrothers have been in #UnitedStates politics over the past several decades. They have used every means at their disposal to subvert democracy.\"","category":"politics"},{"text":"I don't generally celebrate people's death, but this is a sobering read by @NathanJRobinson on the negative influence of the Koch Brothers on the planet and American democracy","category":"politics"},{"text":"Devolving power locally (while not abdicating our responsibility to right international wrongs) and accepting experimentation (within a framework that upholds justice and accountability) are probably the most salient parts of my plan for the future.","category":"crime, law and justice"},{"text":"so wonderful to have a socialist magazine that’s serious yet also fun and joyous, vs pretentious and dreary!  i sometimes feel like it’s produced by me for me, great stuff!","category":"arts, culture and entertainment"},{"text":"To launch a successful new magazine in this era is a remarkable enough achievement. To publish a radical magazine incubating powerful new voices and influencing the public discourse is an astonishing achievement. Three cheers for three years & the hope for the future CA inspires.","category":"economy, business and finance"},{"text":"My initial instinct was to make some smartass joke about how the photo looks like you built your home on a massive hill with no foundation. But honestly that’s a huge accomplishment and you deserve congratulations. You’re doing awesome work. We’ll keep reading/listening.","category":"arts, culture and entertainment"},{"text":"This Friday! We're co-sponsoring author Timothy Faust's stop on his book tour along with @curaffairs. Come listen to @crulge share from his new book on why we need single-payer healthcare and how to achieve it. Join us! https://www.facebook.com/events/458833018302520/ …","category":"arts, culture and entertainment"},{"text":"me in the @guardian today on the political and economic wreckage that David Koch left behind","category":"economy, business and finance"},{"text":"I'll be talking to @crulge about his new book Health Justice Now! at the Garden District Bookshop in New Orleans this Friday at 6pm. Come and join us! https://www.facebook.com/events/458833018302520 …","category":"arts, culture and entertainment"},{"text":".@NathanJRobinson: \"#FoxNews has become as much of a state propaganda outlet as RT is for #Russia or PressTV is for #Iran. There is a revolving door between the #WhiteHouse and the network.\"","category":"arts, culture and entertainment"},{"text":"I don't think the emotion of \"hate\" is bad in and of itself. My problem is with people who despise and oppress the powerless. Hating cruelty and injustice is good, and strong passionate feelings of outrage are important.","category":"social issue"},{"text":"so proud to publish this brilliant piece by Sam on how completely crazy the unnecessary amount of carbon emissions in our food system is","category":"environmental issue"},{"text":"Free market libertarianism of the David Koch variety doesn't care if the entire Amazon burns to the ground so long as someone makes a profit. This is no exaggeration.","category":"economy, business and finance"},{"text":"also yes there are only 19 issues in the photo, #20 is rolling off the presses right now","category":"crime, law and justice"},{"text":"http://currentaffairs.org/subscribe \nhttp://currentaffairs.org/donate \nwe are 100% reader-supported and have zero advertising. every single thing we do is because people who read us believe in us and want to help us.","category":"economy, business and finance"},{"text":"3 years, 20 print issues, hundreds of original articles and illustrations. From a tiny kickstarter campaign run from my living room we've now got an office, paid staff, subscribers all over the world. Thank you so much to @curaffairs subscribers for making it possible!","category":"arts, culture and entertainment"},{"text":"The simple unassailable fact is, Nathan Robinson is the most original and astute political commentator in the US today","category":"politics"},{"text":"I'm still pretty proud of this essay in which I demolish all of the National Review's arguments against socialism one by one:","category":"politics"},{"text":"economics is a death cult","category":"economy, business and finance"},{"text":"Cover art by Aleksandra Waliszewska! https://www.facebook.com/pages/category/Artist/Aleksandra-Waliszewska-152642531244/ …","category":"arts, culture and entertainment"},{"text":"this map from the @nytimes seems almost completely useless\n\nif i'm interpreting right, a place could be dark green if it went from a .01 percent foreign-born to .02 percent. it could literally be one guy!\n\nbut this can/will be used to \"prove\" immigrants flooding the heartland","category":"social issue"},{"text":"The sun is setting on America’s half-century of punishing the sick, and this book promises a bright new dawn for us all.\n-\nJoin us with @crulge in conversation with @NathanJRobinson August 30th at 6pm\n@melvillehouse \nhttps://buff.ly/2Kv4EVo ","category":"social issue"},{"text":"Love this. @curaffairs has been formative to me - I especially appreciate @NathanJRobinson's articles that break down political phenomena in a way that's both rigorous and entertaining. A left antidote to the Vox explainer.","category":"politics"},{"text":"If you want independent media to survive, please consider donating and subscribing to places that depend on reader support rather than advertisers or capitalists \nhttp://currentaffairs.org/subscribe \nhttp://currentaffairs.org/donate \nAnd not just us but @jacobinmag  @thebafflermag @DissentMag etc!","category":"arts, culture and entertainment"},{"text":"@pblest wrote a good article for us a while back on how we might start creating authentically independent media institutions:","category":"arts, culture and entertainment"},{"text":"It's very hard to keep up, and means we have an absolutely tiny paid staff. Sometimes I wish some rich funder would come along. But I think in the long run reader-supported publications are the only way to go. We just have to convince people that it's worth paying for.","category":"economy, business and finance"},{"text":"One thing we're very fortunate to have at @curaffairs magazine is immunity from the whims of billionaires, because all of our money comes from subscriptions and small donations.","category":"economy, business and finance"},{"text":"Sorry Mr. Nimni but the publisher has said we can only send them to \"reputable\" outlets","category":"arts, culture and entertainment"},{"text":"my book's main target market is \"people who want to make their relatives angry by giving it to them as a christmas present\"","category":"religion and belief"},{"text":"Bernie is the only presidential candidate focused on rebuilding a powerful labor movement. If you support @labor4bernie, retweet this article!","category":"politics"},{"text":"Today on the @curaffairs podcast: I have a civil but lively & contentious argument with @ezraklein about many things.","category":"social issue"},{"text":".@NathanJRobinson is just a lovely writer, and I'm glad I finally got around to reading his recap of the DSA convention. You can too:","category":"arts, culture and entertainment"},{"text":"\"It’s 'easier to imagine the end of the world than the end of capitalism.' But we need to have faith that this shows the limits of our imaginations, not the limits of human possibility.\"","category":"religion and belief"},{"text":"wonderful article","category":"arts, culture and entertainment"},{"text":"This will be contentious, as @AnaKasparian and I are known to despise one another.","category":"arts, culture and entertainment"},{"text":"Why? To learn how to lose to a deranged talk show host? This is a terrible move. https://www.nbcnews.com/politics/2020-election/warren-clinton-talk-behind-scenes-2020-race-intensifies-n1049701 … via @nbcnews","category":"politics"},{"text":".@EmmaVigeland asked Elizabeth Warren about her vote to dramatically increase the 2018 military budget, alongside a majority of the Senate. Here's what she said.\n\nWatch HERE: https://www.youtube.com/watch?v=fLLvXCeHogM&t=1s …","category":"politics"},{"text":"Child migrant detention facility propaganda film script got leaked to me and it's wild.\n\n“We see exteriors of Homestead. It is a former military base but we shoot it to capture as much beauty as possible.”\n\nFor @tytinvestigates: https://tyt.com/stories/4vZLCHuQrYE4uKagy0oyMA/6tcosRq7ObVqebKo2ZQR11 …","category":"arts, culture and entertainment"},{"text":"@joniernst im gonna tell you like i told #MoscowMitch. You're not cutting my social security of which ive paid in all my life. You're not raising my retirement age to qualify either. They'll be a #hongkong revolution if u do.","category":"social issue"},{"text":"@AnaKasparian AWESOME show this week with the Chicago artist/activist, @VicMensa! Leaving a 5  rating! Thanks for bringing us such an in depth interview!\n\n#NoFilter\n#cometogether","category":"arts, culture and entertainment"},{"text":"Senator Bernie Sanders responds to a question regarding the imprisonment of Lula da Silva. @_michaelbrooks @SenSanders #LulaLivre #Bernie2020","category":"politics"},{"text":"NEW @Sludge: Co-founder of natural gas firm Western LNG is hosting a Biden fundraiser tonight. The other co-founder was previously CFO of liquefied natural gas pioneer Cheniere Energy, where Biden's current climate adviser had a paid board seat until 2018.","category":"economy, business and finance"},{"text":"Media presented far-right grifter Andy Ngo as a credible journalist. He was just caught covering for far-right extremists as they plan violent attacks.","category":"crime, law and justice"},{"text":"Andy Ngo has been widely discredited & is on video   scheming with far-right groups as they plan an attack on an unsuspecting group that left a woman hospitalized. Andy then doxxed her.\n\nThat would give a reputable outlet pause before booking him.\n\nSo here he is on Tucker tonight","category":"politics"},{"text":"Trump failed American workers even without the trade war\n\nRead the full story:\nhttp://bit.ly/2lVCCIx \n\nVia @AnaKasparian","category":"economy, business and finance"},{"text":"Trump failed American workers even without the trade war https://thehill.com/opinion/white-house/460048-trump-failed-american-workers-even-without-the-trade-war … My first opinion piece for @thehill @TheHillOpinion","category":"labour"},{"text":"Once again if you are unhappy with @SpeakerPelosi then donate to her challenger @ShahidForChange #tytlive","category":"politics"},{"text":"Wow. Really “didn’t” see that coming: Founder of conversion therapy center comes out as gay, apologizes.","category":"health"},{"text":"Sad. A woman weeps, as she lay in a field, with others around her; dozens of rounds of gunfire can be heard in the distance. \n\nShe tweeted: “one of the scariest thing ever to hear n be so close to a shoot!! So glad they shot him dead!” #OdessaShooting","category":"sport"},{"text":"CNN Exclusive: The US extracted one of its top spies from Russia in 2017, worried about exposure and Trump’s handling of intelligence:","category":"politics"},{"text":"URGENT: Friends, we're in need of a liver donor for our daughter Nusayba who has Stage 4 cancer. The surgery scheduled for 9/10 was cancelled b/c the surgeon found a last second complication with the donor who made all the arrangements. It’s a gut punch, but we’re hopeful...1/","category":"health"},{"text":"This is based on Trump and Obama administration ofcials with direct knowledge.","category":"human interest"},{"text":"2/Asset had risen to the highest levels of Russia’s national security infrastructure. US offered extraction months earlier during Obama administration, but asset refused. Asset’s information was crucial to IC assessment that Putin had directed election interference to favor Trump","category":"politics"},{"text":"New tonight: Given NYT has now made details on Russian spy public, I can now report additional info we had withheld. Asset had direct access to Vladimir Putin, including the remarkable ability to take photos of presidential documents, and had served US for more than a decade. 1/","category":"politics"},{"text":"Coming up on @AC360: I’ll report new details on the Russian spy the US extracted from Russia in secret 2017 mission.","category":"politics"},{"text":"Breaking: #NorthKorea launches two unidentified projectiles, says South Korea military. This is the *10th* North Korean missile launch since May.","category":"politics"},{"text":"In a CNN exclusive, @jimsciutto reports that the US extracted one of its top spies from Russia in 2017, worried about exposure and Trump’s handling of intelligence. https://cnn.it/2lFsd3O ","category":"politics"},{"text":"“This is a president who has demonstrated time and time again that he is sloppy with classified information” - Dem Rep @jahimes, House Intel Cmte","category":"economy, business and finance"},{"text":"“The removal happened at a time of wide concern in the intel community about mishandling of intel by Trump & his administration. Those concerns were described to CNN by five sources who served in the Trump administration, intelligence agencies & Congress.”","category":"economy, business and finance"},{"text":"Stand by for news. Tune into CNN at the top of 9am ET.","category":"arts, culture and entertainment"},{"text":"CNN proudly stands with @washingtonpost and its reporters. Continuing attacks on the media and the First Amendment are wrong.","category":"economy, business and finance"},{"text":"President Trump has arrived at his golf club in Sterling, Virginia. It is his 290th day at one of his properties and 228th day at one of his golf clubs.","category":"sport"},{"text":"“I think the president is in severe mental decline, and I’m not saying that now because I’m a political adversary or I disavowed him, I’m saying that objectively just looking at what’s going on.” - Fmr WH Communications Dir @Scaramucci at Toronto Global Forum","category":"politics"},{"text":"New: UK’s House of Lords has approved a bill to force Prime Minister Boris Johnson to seek a Brexit delay. No amendments were passed so the bill does not need to return to the House of Commons.","category":"economy, business and finance"},{"text":"You clearly didn’t watch the interview. I cited our reporters on the ground seeing little organization in the local response and asked what official efforts they are seeing.","category":"social issue"},{"text":"A harrowing account from our colleague @CNN_Oppmann on the ground in the Bahamas - “...the smell of death”","category":"social issue"},{"text":"New: US economy added 130,000 jobs in August, just below expectations. Of the 130,000 jobs added, 25,000 were temporary positions for people to conduct the 2020 census.","category":"social issue"},{"text":"I snuck into Zimbabwe in 2008 when #RobertMugabe stole another election, visiting polls where his party fabricated results. He collapsed the economy leading to the issuance of currency in billions, then trillions. This bill was worth US$1.75. His legacy for the country is clear.","category":"politics"},{"text":"To the untrained eye, the 127 defense projects postponed for the border barrier may seem confusing. But as a former commander in Europe, many of these - elementary schools, training support projects, etc - are big deals. “Support the troops?” Not so much.","category":"politics"},{},{"text":"My computer is using the wrong graphics card","category":"crime, law and justice"},{"text":"This is a newly addes tweet about sport","category":"sport"},{"text":"This is a basketball tweet","category":"sport"},{"text":"This is a wholy new basketball tweet","category":"sport"},{"text":"My 9 year old son ⁦@MomsDemand⁩ at white plains city hall #RecessRally","category":"labour"},{"text":"There will be a lot of bluster and bombast from Lewandowski today, but what I'm most interested in is the questioning from @BarryBerke. One of the country's best criminal defense attorneys sitting on the dais for the D's.","category":"disaster and accident"},{"text":"The lesson the Senate, the FBI, the president and Kavanaugh sent to victims was: The male perpetrator can orchestrate, choreograph and curate the process to avoid accountability.","category":"politics"},{"text":"Trump tried to use Lewandowski to intimidate Sessions & limit Mueller precisely because CL wasn’t in official chain of command. Trump needed someone on outside to do his dirty work for him. That’s why they met alone, why CL didn’t want an official meeting with Sessions at DOJ.","category":"labour"},{"text":"\"This was never just about Kavanaugh or a seat on the Supreme Court. This is a lens for whether our elected officials are capable of listening to women and sexual assault survivors.\" \n\nAn important piece from @MimiRocah1:","category":"crime, law and justice"},{"text":"Looking forward to joining @mitchellreports today.","category":"disaster and accident"},{"text":"Confirmed: Powerful men ignored women in short-circuited Brett #Kavanaugh investigation, says @Mimirocah1.","category":"science and technology"},{"text":"YES! @Mimirocah1 makes the key point: a STATE GRAND JURY SUBPOENA is a different animal altogether. Expect Trump to ignore states’ rights by trying to get a federal court to intervene. 28 USC § 2283 will stop that end run. I won Penzoil v. Texaco, 481 US 1 (1987), on that basis.","category":"environmental issue"},{"text":"Remember @HouseJudiciary, don't ask Lewandoski his opinions on Trump's conduct. Ask him what happened and who said what. Lewandoski's conclusions about the import of Trump's conduct are absolutely irrelevant.","category":"social issue"},{"text":"*be","category":"politics"},{"text":"So @CLewandowski_ will NOT an impartial, fact-based witness in case anyone had any doubts.","category":"crime, law and justice"},{"text":"Like the confirmation hearings, “the new information about a short-circuited investigation of victims’ claims isn't only about one SC justice. It’s about how women & sexual assault survivors are fed up with feeling silenced.” By me ⁦@usatodayopinion⁩","category":"crime, law and justice"},{"text":"Who's Lewandowski, testifying Tue? See @BarbMcQuade, Mueller summaries by @K8brannen @gtconway3d @jendaskal @K_Eichensehr @rgoodlaw @eliehonig @harrylitman @renato_mariotti @AshaRangappa_ @Mimirocah1 @ThePaulSRyan @ritasiemion @JoyceWhiteVance @AndyMcCanse","category":"politics"},{"text":"This feels very big. A grand jury subpoena can’t be ignored the way Trump & co. do with every other subpoena. They’ll have to answer swiftly to a NYS judge if they don’t comply by return date.","category":"crime, law and justice"},{"text":"“The average age of women who experienced forced sexual initiation was 15.6. The average age of the partner or assailant at the time was 6 years older.”","category":"politics"},{"text":"House should consider public safety, deterrence, and respect for the rule of law over politics when considering whether to impeach. My thoughts about what Congress can learn from prosecutors in ⁦@USATODAY⁩.","category":"labour"},{"text":"Important article. Epstein-type sex trafficking is happening right now to girls (& boys) from many different backgrounds. And the Trump Administration isn’t doing nearly enough to try & stop it.","category":"labour"},{"text":"Admit it, my merch store has always been ahead of its time.  \nhttp://bit.ly/2kntxrO ","category":"labour"},{"text":"We wrote: there is no legitimate reason to rush a confirmation vote. Confirming Kavanaugh under the current circumstances would undermine both his legitimacy & the integrity of the Supreme Court. Before a lifetime appointment, the FBI must have time to investigate this allegation","category":"politics"},{"text":"Reupping this piece I did with my “sisters in law” ⁦@JillWineBanks⁩ ⁦@BarbMcQuade⁩ ⁦@JoyceWhiteVance⁩ ⁦@mayawiley⁩ before Ford testified about need for a “full & fair” investigation. Something that clearly didn’t happen.","category":"social issue"},{"text":"Meaning evidence the FBI was told not to investigate? Also, was there a vote on this that I missed? Because just about everyone I’ve heard from believed her. Even the Republicans had to go with the ridiculous “she was attacked but must’ve been someone else.”","category":"politics"},{"text":"Turkey Syria offensive: Your questions answered","category":"sport"},{"text":"South Africa’s Gupta brothers sanctioned by US over 'corruption'","category":"politics"},{"text":"East Germany's last communist leader, Egon Krenz, says the fall of the Berlin Wall was the \"worst night of my life\"\n\n[Tap to expand] https://bbc.in/323xKS5 ","category":"science and technology"},{"text":"Women in Iran attend first football match in decades","category":"sport"},{"text":"Kerala cyanide killing: Crowd boos family poisoning suspect in India","category":"politics"},{"text":"UK will deport EU citizens after Brexit if they miss registration, Home Office minister says","category":"science and technology"},{"text":"England: Bulgaria criticises plan to leave pitch over racist abuse","category":"social issue"},{"text":"Trump donors charged in campaign finance case","category":"politics"},{"text":"German synagogue shooting was far-right terror, justice minister says","category":"unrest, conflicts and war"},{"text":"Rare copy of first Harry Potter book sells for £46,000 at auction","category":"arts, culture and entertainment"},{"text":"Altaf Hussain: Pakistan MQM founder charged over 'hate speech' in UK","category":"politics"},{"text":"Mozambique election observer killed by 'elite police' in drive-by shooting","category":"crime, law and justice"},{"text":"Ukraine's president says 'no blackmail' in Trump call","category":"crime, law and justice"},{"text":"Turkey Syria offensive: Will Islamic State re-emerge?","category":"politics"},{"text":"UK PM Boris Johnson and Ireland's Leo Varadkar hold key Brexit talks \n\nhttp://bbc.in/2B0CfRq ","category":"politics"},{"text":"Stalker 'found Japanese singer through reflection in her eyes'","category":"arts, culture and entertainment"},{"text":"Romania's government collapses after losing a no-confidence vote ahead of presidential election","category":"politics"},{"text":"Bicky Burger removes 'sickening, irresponsible' Facebook ad","category":"arts, culture and entertainment"},{"text":"Nobel Prize for Literature for 2018 and 2019 given to Polish writer Olga Tokarczuk and Austrian writer Peter Handke","category":"arts, culture and entertainment"},{"text":"Woman at the centre of diplomatic immunity row will not return to the UK, according to briefing notes held by President Trump","category":"politics"},{"text":"Banning staff access to work emails outside office hours to help them switch off, might actually cause stress - says a study.\n\nDo you check work emails at home? \nHow do you deal with inbox overload?\n\nJoin @LVaughanJones & me #BBCWorkLife @BBCBusiness 0830","category":"economy, business and finance"},{"text":"A fierce dust storm in Australia turned day in to night in seconds \n\n[tap to expand] http://bbc.in/32qlrPZ ","category":"lifestyle and leisure"},{"text":"Abominable: A DreamWorks movie, a map, and a huge regional row","category":"lifestyle and leisure"},{"text":"Does Huawei's future lie with India after US ban?","category":"economy, business and finance"},{"text":"Australian racehorse slaughter allegations prompt investigation","category":"unrest, conflicts and war"},{"text":"Son of Mexican drug lord 'El Chapo' captured","category":"social issue"},{"text":"Snowy 2.0: Australia's divisive plan for a vast underground 'battery'","category":"crime, law and justice"},{"text":"Viewpoint: Time for girls in space and sex without power","category":"social issue"},{"text":"How publicity-shy professor Kais Saied became Tunisia's president","category":"economy, business and finance"},{"text":"Quiz of the week: How did Fortnite reinvent itself?","category":"arts, culture and entertainment"},{"text":"Africa's top shots: 11 -17 October 2019","category":"lifestyle and leisure"},{"text":"Sulli: The woman who rebelled against the K-pop world","category":"arts, culture and entertainment"},{"text":"Rick Perry: US energy secretary quits amid Trump inquiry","category":"lifestyle and leisure"},{"text":"What Canadians are thinking about ahead of the election\n[Tap to expand] https://bbc.in/33IaNnA  #elxn43","category":"lifestyle and leisure"},{"text":"Alicia Alonso: Legendary ballet dancer dies aged 98","category":"arts, culture and entertainment"},{"text":"A Canadian election looms - six charts explain all","category":"politics"},{"text":"President Trump's Florida resort was chosen as the next G7 locale because it was \"by far and away\" the best option, the White House said\n\n[Tap to expand]\n\nhttps://bbc.in/2MOGUvd ","category":"politics"},{"text":"Two Russians on trial for belonging to anarchist organisation slit their wrists in court","category":"crime, law and justice"},{"text":"Venezuela wins seat on UN Human Rights Council","category":"politics"},{"text":"US vice-president says Turkey agrees to \"pause\" military operations, while the US assists with \"withdrawal\" of Kurdish forces in northern Syria\n\nOnce that is completed Turkey \"has agreed to a permanent ceasefire\", he says\n\nhttp://bbc.in/2IYt34s ","category":"politics"},{"text":"Lady Gaga plummets off stage in a fan's arms during Vegas show ","category":"health"}]